# Charging Icons
icons_charging=("󰂅" "󰂋" "󰂊" "󰂉" "󰂈" "󰂇" "󰂆" "󰁻" "󰁺")

# Discharging Icons
icons_discharging=("󰂂" "󰂁" "󰂀" "󰁿" "󰁾" "󰁽" "󰁼" "󰁻" "󰁺")

# Power Menu Icons
power_menu_icons=("" "" "" "" "" "")

# Launcher Icons
launcher_icons=("")

# Tools Icons
tools_icons=("📸")

# Moon Icons
moon1=("" "" "" "" "" "" "" "" "" "" "" "" "" "")
moon2=("" "" "" "" "" "" "" "" "" "" "" "" "" "")
moon_choice=("" "" "" "" "" "" "" "" "")

# Ghost Icons
ghost_icons=("" "󱙝" "󰊠" "󱙜" "󰧵")

# General Icons
icons=("󰂑" "󰂐" "󰂏" "󰂎" "󰂍" "󰂌" "󰂋" "󰂊" "󰂉" "󰂈" "󰂇" "󰂆" "󰂅" "󰂄" "󰂃" "󰂂" "󰂁" "󰂀" "󰁿" "󰁾" "󰁽" "󰁼" "󰁻" "󰁺" "󰁹")

# System Resource Icons
system_resource_icons=("" "")

# Folder Icons
folders=("" "󱂵" "󰉍" "󱧶" "󰉏" "󱍙" "󱧺" "󰉋" "󰉌" "󰉍" "󰉎" "󰉏" "󰉒" "󰉓" "󰉔" "󰉕" "󰉖" "󰉗" "󰉘" "󰉙" "")

# Tools
tools=("📸" "" "" "" "" "" "󰇮")

# Chess Pieces
chess=("♔" "♕" "♖" "♗" "♘" "♙" "♚" "♛" "♜" "♝" "♞" "♟")

# Notifications Icons
notifications=("󱏧" "󱏨" "󱏩" "󱏪" "󱏫" "󱏬" "")

# Bluetooth Icons
bluetooth=("" "󰂱" "" "󰂲" "" "󰂯" "󱄙")
